{
  "jobKey": "11f182be62391fae",
  "title": "Backend Developer - Việc làm gần đây",
  "companyName": "Viec Oi client",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=11f182be62391fae",
  "datePublished": "2025-09-26",
  "isRemote": false,
  "rating": 0,
  "numOfCandidates": null,
  "companyLogoUrl": null,
  "descriptionText": "CHI TIẾT CÔNG VIỆC\nBe responsible for back-end development of web services for sales representatives.\nApplication development, API development\nLoad test design and implementation\nRemoving technical debt\nMeasurement of campaign effectiveness and service improvement through quantitative and qualitative analysis of user behavior logs, etc.\nThis position, those with extensive track record and experience are expected to take on the role of technical and organizational leader in the future.\nDeep involvement with the planning and design teams from the functional design stage\nArchitecture design and improvement, middleware selection\nDatabase design and construction, AWS design and construction\nEngineer training, technical support\nSKILLS EXPERIENCE REQUIREMENTS\nAge : 25-35\nPre intermediate English\nA strong sense of ownership and a desire to develop and improve services\nExperience in back-end development using Python for web application development\nUnderstanding of multi-table structures and SQL operations such as joins and subqueries\nExperience in team development using Git and a basic understanding of version control\nExperience developing using Docker and a basic understanding of container technology\nPREFERABLE :\nExperience using FastAPI or other web frameworks\nExperience using cloud services such as AWS or Azure DevOps\nBasic knowledge of HTML, CSS, React, Next.js, TypeScript, and Sass, or a willingness to learn\nExperience designing APIs with Next.js or React in mind\nKnowledge and experience in performance tuning and scalability improvements\nExperience with Scrum developmen\nĐịa điểm làm việc: TPHCM\nLương: 30000K - 45000K VND một tháng\nLoại hình công việc: Thỏa thuận thời gian\nYêu cầu:\nQuyền lợi: Chăm Sóc Sức Khỏe, Chế độ bảo hiểm, Du Lịch, Nghỉ thứ 7chủ nhật, Thưởng Tháng 13\nHạn nộp: 2025-10-11\nKinh nghiệm: Không yêu cầu kinh nghiệm làm việc\nBằng cấp: Đại học\nLĩnh vực: IT/CNTT -IT Phần mềm - Backend Developer, Cloud Engineer, CNTT khác, Developer, Python Developer\nKỹ năng: API, AWS, Docker, Python, SQL\nSố lượng cần tuyển: 1\nGiới tính: Không yêu cầu"
}