{
  "jobKey": "19a534b501eac404",
  "title": ".NET, JAVA Developer (Core T24)",
  "companyName": "Vietnam International Bank",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=19a534b501eac404",
  "datePublished": "2025-09-29",
  "isRemote": false,
  "rating": 4.2,
  "numOfCandidates": null,
  "companyLogoUrl": null,
  "descriptionText": "Khối / Ban Khối Dịch vụ Công nghệ Ngân hàng\nLĩnh vực Công nghệ thông tin\nĐịa điểm Hà Nội, Hồ Chí Minh\nLoại hình công việc Fulltime (toàn thời gian)\nThời hạn ứng tuyển 31/10/2025\nSố lượng cần tuyển 2\nMô tả công việc\n\nTrách nhiệm\n\nChịu trách nhiệm (i) Phát triển và tích hợp các ứng dụng công nghệ phục vụ hoạt động kinh doanh trong các lĩnh vực Cho vay, Thẻ, Tiền gửi và Thu hồi nợ theo yêu cầu nghiệp vụ; (ii) Tìm hiểu, nghiên cứu xu hướng công nghệ, công cụ mới để đề xuất các giải pháp phù hợp hỗ trợ chuyển đổi số, nâng cao hiệu quả vận hành và trải nghiệm khách hàng trong các mảng kinh doanh liên quan.\n\n1. Phát triển và triển khai giải pháp ứng dụng (35%)\n\n- Tiếp nhận và nghiên cứu các yêu cầu đã được phân tích bởi đội ngũ Phân tích nghiệp vụ (BA) để hiểu rõ mục tiêu, phạm vi và kỳ vọng của nghiệp vụ.\n\n- Phát triển, kiểm thử đơn vị (unit test) và triển khai các tính năng, đảm bảo đúng hạn và tuân thủ tiêu chuẩn mã hóa, bảo mật.\n\n- Phối hợp với các nhóm liên quan trong quá trình tích hợp và triển khai.\n\n2. Thiết kế chi tiết giải pháp và tài liệu hóa (25%)\n\n- Thực hiện và duy trì tài liệu thiết kế kỹ thuật chi tiết, đảm bảo rõ ràng, đầy đủ, tuân thủ chuẩn kiến trúc.\n\n- Thực hiện thiết kế chi tiết, đảm bảo chất lượng và tính khả thi của giải pháp.\n\n- Đảm bảo liên kết chặt chẽ giữa yêu cầu nghiệp vụ, thiết kế và giải pháp triển khai.\n\n3. Quản lý rủi ro và xử lý sự cố (20%)\n\n- Chủ động nhận diện các rủi ro kỹ thuật, đề xuất biện pháp giảm thiểu.\n\n- Phối hợp xử lý kịp thời các vấn đề phát sinh trong phạm vi công việc, đảm bảo SLA.\n\n- Thực hiện đánh giá tác động chính xác khi có sự thay đổi hoặc rủi ro phát sinh.\n\n4. Hợp tác dự án và phát triển năng lực (15%)\n\n- Hợp tác chặt chẽ với các nhóm liên phòng ban trong quá trình phát triển và triển khai giải pháp.\n\n- Thực hiện thiết kế chi tiết và triển khai, chia sẻ kinh nghiệm, góp phần xây dựng năng lực đội nhóm.\n\n- Chủ động học hỏi, cập nhật kiến thức mới và tham gia các hoạt động đào tạo, huấn luyện.\n\n5. Thực hiện các nhiệm vụ khác theo sự phân công của cấp quản lý (5%)\n\nYêu cầu ứng viên:\n\nTốt nghiệp Đại học trở lên các ngành Công nghệ Thông tin, Hệ thống Thông Tin, Khoa học Máy tính, Toán Tin hoặc các chuyên ngành có liên quan.\nTối thiểu 7 năm (Chuyên gia)/ 5 năm (Chuyên viên cao cấp)/ 3 năm (Chuyên viên chính)/ 2 năm (Chuyên viên) kinh nghiệm làm việc trong lĩnh vực vận hành hệ thống công nghệ trong ngành tài chính, ngân hàng.\nƯu tiên ứng viên đã tham gia các dự án Core Banking, Thẻ, Thu hồi nợ, Thanh toán hoặc các hệ sinh thái dịch vụ số.\nHiểu rõ quy trình phát triển ứng dụng, thiết kế chi tiết.\nCó kiến thức và kinh nghiệm triển khai hệ thống đa lớp, API, microservices, container (Docker, Kubernetes...).\nCó kinh nghiệm làm việc với các hệ thống lõi ngân hàng, hệ thống thẻ, thu hồi nợ, hệ thống thanh toán, hoặc tích hợp hệ sinh thái dịch vụ số\nCó các chứng chỉ quốc tế về Cloud phát triển/ quản trị ứng dụng, thiết kế chi tiết là một lợi thế.\nThành thạo một hoặc nhiều ngôn ngữ lập trình (Java, .NET, Python...) và công cụ quản lý mã nguồn (Git, Jenkins, Jira, Azure DevOpt…).\nĐã làm việc với các hệ cơ sở dữ liệu tiên tiến: Oracle, Microsoft SQL Server, MySQL, PosgreSQL, MongoDB,…\nKinh nghiệm phát triển và vận hành các hệ thống trên nhiều môi trường: Cloud AWS, Azure, Google, On-prem\nĐọc hiểu tài liệu phân tích, thiết kế kiến trúc, biểu đồ kỹ thuật.\nPhân tích, giải quyết vấn đề logic.\nLập kế hoạch, quản lý tiến độ công việc.\nGiao tiếp hiệu quả với đối tượng kỹ thuật và phi kỹ thuật.\nLàm việc độc lập hoặc làm việc nhóm, sẵn sàng hỗ trợ và chia sẻ.\nTiếng Anh: có khả năng đọc hiểu tài liệu kỹ thuật.\nTOEIC đạt 500 trở lên hoặc IELTS đạt 5.5 trở lên là một lợi thế."
}