{
  "jobKey": "34c3d683ae2e0ded",
  "title": "DATA SCIENTIST (MID/SENIOR - KỸ SƯ KHOA HỌC DỮ LIỆU, HCM)",
  "companyName": "FPT Telecom",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=34c3d683ae2e0ded",
  "datePublished": "2025-09-25",
  "isRemote": false,
  "rating": 3.9,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/858d105261c29fe21c5436ccfbd427d1",
  "descriptionText": "Số lượng cần tuyển: 1\nLoại hình công việc: Toàn thời gian\nĐơn vị quản lý: Trung Tâm Hệ Thống Thông Tin\nMức lương: lương thỏa thuận\n\nHạn nộp hồ sơ:\n\n 24-10-2025\nCHI TIẾT CÔNG VIỆC\n\n1. Thiết kế giải pháp:\n\nLàm việc chặt chẽ với các bộ phận khác nhau (Marketing, Sales, Customer Service, Product) để hiểu rõ nhu cầu thực tế, khai phá khả năng thúc đẩy hoạt động kinh doanh, chăm sóc khách hàng bằng dữ liệu.\nThiết kế giải pháp, thử nghiệm và phát triển các mô hình thống kê và AI/ML phù hợp với nhu cầu kinh doanh, khả thi và có thể mở rộng.\nĐảm bảo tính tuân thủ các tiêu chuẩn bảo mật và quy định về dữ liệu.\n\n2. Triển khai dự án Data Science:\n\nTham gia vào các dự án Data Science, phân tích hành vi khách hàng, dự đoán nhu cầu, cá nhân hóa trải nghiệm, và giải quyết các vấn đề của khách hàng một cách chủ động.\nXây dựng các mô hình hỗ trợ ra quyết định và đề xuất các giải pháp cho vấn đề kinh doanh.\nTriển khai các mô hình AI/ML để giải quyết các bài toán cụ thể trong lĩnh vực (ví dụ: phân tích sentiment, dự đoán churn, đề xuất sản phẩm, tối ưu hóa giá).\nĐánh giá hiệu quả và cải thiện giải pháp.\n\n3. Nghiên cứu và đào tạo phát triển:\n\nNghiên cứu và áp dụng các kỹ thuật mới trong lĩnh vực Data Science và AI/ML.\nHỗ trợ đào tạo nâng cao năng lực Data Science cho các thành viên trong nhóm.\nHướng dẫn và cố vấn cho các thành viên khác trong nhóm và các bộ phận liên quan.\nYÊU CẦU CÔNG VIỆC\nTốt nghiệp Cử nhân/Thạc sĩ trong lĩnh vực Khoa học dữ liệu, Khoa học máy tính, Toán học, Kỹ thuật Viễn Thông hoặc các lĩnh vực liên quan.\nỨng viên có ít nhất 3 năm kinh nghiệm làm việc trong lĩnh vực Data Science, Machine Learning, hoặc phân tích dữ liệu trong ngành viễn thông/ISP là một lợi thế lớn.\nKiến thức vững chắc về các phương pháp thống kê và phân tích dữ liệu; các thuật toán Machine Learning (ví dụ: regression, classification, clustering, NLP, recommendation systems),\nThành thạo Python hoặc R.\nCó kinh nghiệm xây dựng và triển khai các mô hình Machine Learning vào các bài toán thực tế.\nCó kinh nghiệm làm việc với SQL và NoSQL databases (ví dụ: PostgreSQL, MySQL, MongoDB).\nCó kinh nghiệm làm việc với các công cụ Big Data (ví dụ: Hadoop, Spark, Kafka); các công cụ MLOps (kubeFlow, MLflow) là một lợi thế lớn.\nHiểu biết về các quy trình phát triển phần mềm và MLOps.\nKỹ năng làm việc nhóm, giải quyết vấn đề , tư duy phản biện tốt và quản lý thời gian hiệu quả.\nCó các chứng chỉ chuyên ngành (Data Analytics Professional Certificate; AWS Certified Machine Learning – Specialty; Data Science Council of America (DASCA),...) là một lợi thế.\nQUYỀN LỢI\nGói thu nhập năm hấp dẫn (13 tháng lương, thưởng hiệu quả kinh doanh, thưởng Quý, Năm...).\nĐầy đủ các chế độ theo luật lao động hiện hành.\nChính sách phúc lợi theo quy định của Công ty đa dạng: Chăm sóc sức khỏe định kì hàng năm; Gói bảo hiểm sức khỏe chuyên biệt (FPT Care – Khám chữa bệnh miễn phí tại tất cả các bệnh viện); Các hoạt động tri ân, chăm lo đời sống tinh thần CBNV và Thân nhân ...\nMôi trường làm việc thân thiện, cởi mở.\nCơ sở vật chất và công cụ làm việc hiện đại, tiện nghi.\nNhiều cơ hội phát triển và thăng tiến.\nVăn hóa Doanh nghiệp đặc sắc, sinh động bậc nhất với nhiều các hoạt động hấp dẫn: tân binh, teambuilding, thi trạng, hội làng, hội diễn Sao Chổi, sinh nhật FPT, ngày 08/03, ngày 11/11...\nHưởng các gói ưu đãi cước khi sử dụng dịch vụ của FPT Telecom.\n\nGhi chú: FPT Telecom không thu bất kỳ chi phí nào của Ứng viên, Sinh viên trong quá trình tuyển dụng, thực tập.\nThông tin liên hệ: Ôn Thanh My\nEmail: myot2@fpt.com\nĐiện thoại cố định: 8270\nĐiện thoại di động: 0703057943"
}