{
  "jobKey": "3c374b18944284d6",
  "title": "Senior Brand Manager (FreeStyle Libre)",
  "companyName": "Abbott",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=3c374b18944284d6",
  "datePublished": "2025-09-25",
  "isRemote": false,
  "rating": 3.9,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/75bf1a6fa23927699207a21afa4f2b8d",
  "descriptionText": "About Abbott\n\nAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.\n\nWorking at Abbott\n\nAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:\n\nCareer development with an international company where you can grow the career you dream of.\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.\n\nDiabetes\n\nWe’re focused on helping people with diabetes manage their health with life-changing products that provide accurate data to drive better-informed decisions. We’re revolutionizing the way people monitor their glucose levels with our new sensing technology.\n\nJOB SUMMARY\n\n• Lead the execution for all marketing activities related to HCPs and consumers in Vietnam for FreeStyle Libre\n\n• Be expected to play a leadership role in HCP and Consumer marketing areas\n\n• To develop and align the annual marketing plan for different brand positioning and channel, co-ordinate successful implementation and grow the long-term sales, profit and market share position for assigned products.\n\n• To partner with the Area team and build the annual marketing strategy and plan development, and gains across functional and management alignment to achieve targeted sales growth and market share.\n\nMAIN RESPONSIBILITIES\n\nHCP marketing\n\nPrepare HCP marketing materials related to FreeStyle Libre by ensuring timely translation of global/approved materials used to Vietnamese language.\nExecute a HCP marketing toolbox and selling kits including campaign and sales tools for the sales teams to use with endocrinologists, diabetologists and diabetic nurse educators.\nSupport local and international congress’s, forums, and meetings in promoting the sensing portfolio awareness.\nHelp facilitate team to understand therapeutic areas and opportunities for ADC existing and new products by conducting medical and product training for sales force; ensure the integrity of all training across the sensing portfolio at the highest levels.\nDevelop annual medical marketing and education plan which is aligned with marketing strategies and plan.\nAct as medical and product consultant to sales and marketing team.\nDevelop an effective feedback loop coming from within the field to support the development of HCP marketing materials and training needs\nEnsure quarterly product knowledge training, refreshment and testing for the sales team\n\nConsumer marketing\n\nDesign and seek endorsement for an effective consumer marketing plan that will achieve affiliate goals\nUnderstand and infuse global research insights into marketing plans where possible and identifying and fulfilling research gaps where necessary.\nAdapt existing best practice creative materials and content and apply the content effectively at various consumer touchpoints\nMaintain an update an end to end customer journey map with key touchpoints and channels identified\nPartner with local agencies to develop an effective media and channel plan\nDrive local e-commerce sales by working with appointed e-commerce parties of ANI Vietnam and development of CRM activities\nLocalize and execute O2O consumer marketing engagements based on global / regional guidance / assets for Vietnam\n\nOther\n\nAdopt and adapt HCP and hospital segmentation and consumer segmentation for relevant targeting strategies and relevant messaging.\nMaintain and monitor a marketing measurement framework that covers all aspects of marketing\nPrepare and align quarterly marketing updates that can be rolled up and presented as part of financial cycles\nAdopt marketing planning tools from Global and Area to drive the strategic management of marketing across channels\n\nMINIMUM BACKGROUND/ EXPERIENCE REQUIRED\n\nWork Experience\n\nExperience - 6-8 years\n\nExperience Details\n\nWorking experience in OTC or Medical Device or FMCG market is preferred; strong medical and clinical background or experience on diabetes care/insulin will be a plus\nExperience in consumer marketing and/ or medical marketing experience in MNC\nE-Commerce experience in Vietnam highly desirable\n\nCORE Skills Required\n\nBehavioral / Leadership Skill\n\nGood presentation skills and oral communication skills·\nProactive in problem resolving and a team player\nSelf-motivated, creative and well organized\n\nLanguage Skill\n\nGood command of English\n\nComputer Skill\n\nMS Office\n\nEducation\n\nBachelor Degree\nMBA or marketing management from a reputable university would be an advantage"
}