{
  "jobKey": "4f60b0038ed2ed1c",
  "title": "Bridge Software Engineer (in HCM)",
  "companyName": "Hitachi Digital Services",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=4f60b0038ed2ed1c",
  "datePublished": "2025-10-02",
  "isRemote": false,
  "rating": 3.5,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/bf341f066bdf4dfca21c985ee4d811f6",
  "descriptionText": "Our Company\n\nWe're Hitachi Digital Services, a global digital solutions and transformation business with a bold vision of our world's potential. We're people-centric and here to power good. Every day, we future-proof urban spaces, conserve natural resources, protect rainforests, and save lives. This is a world where innovation, technology, and deep expertise come together to take our company and customers from what's now to what's next. We make it happen through the power of acceleration.\n\nImagine the sheer breadth of talent it takes to bring a better tomorrow closer to today. We don't expect you to 'fit' every requirement – your life experience, character, perspective, and passion for achieving great things in the world are equally as important to us.\n\nThe team\n\nHitachi Digital Services Vietnam is part of a 300 strong global delivery network, supporting Hitachi Digital Services around the globe. Our employees collaborate with teams in Japan, India, Portugal, and the US, servicing customers worldwide and working on a huge variety of projects. From cloud migration to digital modernization and advanced analytics, offering operational excellence, agile delivery, and plenty of energy to work on huge transformation projects for our customers.\n\nThe role\n\nThe Bridge Software Engineer (BrSE) who will manage projects or work closely with Project Manager to monitor and control the project; and work closely with the team to understand the project's insights. This role needs to communicate with Japanese clients for requirements, issue clarifications to make sure that there is no gap in the understanding between customer and project team including the followings:\n\nAnalyze and transfer requirements to project team.\nVerify and develop design documents.\nControl inbound and outbound project's materials.\nDevelop and perform test cases to verify the deliverables.\nUnderstand the clients and maintain the good business relationship with them.\n\nWhat you'll bring\n\nBachelor's degree with a major in software development, information technology or related fields.\nJapanese language proficiency equivalent to JLPT N2 or higher is required.\nGood programming skill/knowledge on C/C++/C#, Python, AI/ML, etc.\nGood requirement analysis skills.\nExperience in writing document, giving presentations, and working directly with Japanese customers.\nWell-organized, creative, and capable of performing multiple tasks simultaneously.\nSelf-motivated and eager to learn (in business domain, software engineering, language), high responsibility and teamwork spirit.\nWilling to go onsite in Japan.\nProficiency in English is a plus.\nBanking domain knowledge is a plus.\n\nAbout us\n\nWe're a global, team of innovators. Together, we harness engineering excellence and passion to co-create meaningful solutions to complex challenges. We turn organizations into data-driven leaders that can make a positive impact on their industries and society. If you believe that innovation can bring a better tomorrow closer to today, this is the place for you.\n\n#LI-VL1\n\nFostering innovation through diverse perspectives\n\nHitachi is a global company operating across a wide range of industries and regions. One of the things that sets Hitachi apart is the diversity of our business and people, which drives our innovation and growth.\n\nWe are committed to building an inclusive culture based on mutual respect and merit-based systems. We believe that when people feel valued, heard, and safe to express themselves, they do their best work.\n\nHow we look after you\n\nWe help take care of your today and tomorrow with industry-leading benefits, support, and services that look after your holistic health and wellbeing. We're also champions of life balance and offer flexible arrangements that work for you (role and location dependent). We're always looking for new ways of working that bring out our best, which leads to unexpected ideas. So here, you'll experience a sense of belonging, and discover autonomy, freedom, and ownership as you work alongside talented people you enjoy sharing knowledge with.\n\nWe're proud to say we're an equal opportunity employer and welcome all applicants for employment without attention to race, colour, religion, sex, sexual orientation, gender identity, national origin, veteran, age, disability status or any other protected characteristic. Should you need reasonable accommodations during the recruitment process, please let us know so that we can do our best to set you up for success."
}