{
  "jobKey": "62340215fb88e580",
  "title": "Senior Data Scientist",
  "companyName": "GFT TECHNOLOGIES",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=62340215fb88e580",
  "datePublished": "2025-09-30",
  "isRemote": false,
  "rating": 4.1,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/34eae00dd0b7765a51f6cfcfbb1c0d2f",
  "descriptionText": "What do we do?\n\nAs a pioneer for digital transformation, GFT develops sustainable solutions across new technologies – from cloud engineering and artificial intelligence to blockchain/DLT. With its deep technological expertise, strong partnerships, and comprehensive market know-how, GFT offers advice to the financial and insurance sectors, as well as the manufacturing industry. Through the intelligent use of IT solutions, GFT increases productivity and creates added value for clients. Companies gain easy and safe access to scalable IT applications and innovative business models.\n\nWho are we?\n\nHaving started in Germany in 1987, GFT Technologies has grown to become a trusted Software Engineering and Consulting specialist for the international financial industry, counting many of the world’s largest and best-known banks as our clients. We are an organization that empowers you to not only explore but also raise your potential and seek out opportunities that add value. At GFT, diversity, equality, and inclusion are at the core of who we are. Ensuring a diverse and inclusive working environment for all communities is one of the main pillars of our diversity strategy, based on our core values and culture. We have been certified for 2022/23 as a ‘Great Place to Work’ in the APAC region. So, if you want to have the opportunity to work with an outstanding and progressive organization, this position could be right for you.\n\nRole Summary\n\nWe’re seeking a seasoned Senior Data Scientist who can tackle complex business challenges and transform them into innovative technical solutions. In this role, you’ll dive deep into statistical analysis, data mining, and cutting-edge Large Language Model (LLM) technologies to shape the future of AI-driven products. You’ll engage hands-on with emerging technologies, pushing the boundaries of what’s possible in AI from early ideation and research through to final delivery. Join us to take the helm in developing data-driven product features, mentor up-and-coming talent, and help define the next frontier of AI-powered innovation! You will closely collaborate with not only the data team but also product managers and engineers to ensure successful analytics or AI feature execution.\n\nSign-on Bonus: Eligible for candidates who are currently employed elsewhere and able to join GFT within 30 days of offer acceptance.\n\nKey Responsibilities\n\nHuman-Centered Analysis: Manipulate human behavior, sentiment, and language data to uncover hidden patterns and support data-driven decision-making.\nAI/ML Model Development: Craft effective prompts to interact with AI models, optimizing output quality and relevance, performing fine-tuning, data feeding, validation, and engineering for continuous improvement.\nDeliver Pragmatic Solutions: Consistently make pragmatic technical decisions that prioritize business value and speed of delivery, aligning with our early-stage startup environment.\nCross-functional Collaboration: Work with other product and engineering teams to understand data needs and ensure smooth data solution delivery\n\nRequired Qualifications\n\n6+ years of relevant data science experience, with a strong emphasis on consumer-facing platforms, human-generated data, or equivalent data science domains.\n4+ years of experience applying advanced statistical methods and data mining techniques to identify new business opportunities and address existing challenges,\nincluding experience building data products from concept to production\nExperience with Natural Language Processing (NLP), AI/Machine Learning (ML), including LLMs and trendy ML models, encompassing prompt engineering, fine-tuning,\npipeline setup, validation, and Quality Assurance (QA) for targeted applications.\nExpertise in SQL, one or more programming languages (Python, R, C++, Java), and familiarity with data science libraries and toolkits.\nExperience translating complex technical concepts to non-technical partners.\n\nPreferred Qualifications\n\nKnowledge of Data Engineering, DevOps practices for AI model deployment, and MLOps principles.\nAWS Experience: Familiarity with core AWS services used in a data context.\nExperience in a Startup Environment: Comfortable with ambiguity and a fast-paced setting.\n\n(Note: Due to the high volume of applications we receive, we are unable to respond to every candidate individually. If you have not received a response from GFT regarding your application within 10 workdays, please consider that we have decided to proceed with other candidates. We truly appreciate your interest in GFT and thank you for your understanding.)\nAbout Us\n\nWe show commitment to our investors and stand for solid, long-term growth performance. Founded in Germany in 1987 and in American territory since 2008, GFT expanded globally to over 10,000 experts. And to more than 15 markets to ensure proximity to clients. With new opportunities from Asia to Brazil, the international growth story continues. We are committed to grow tech talents worldwide. Because our team’s strong consulting and development skills across legacy and pioneering technologies, like GreenCoding, underpin success. We maintain a family atmosphere in an inclusive work environment.\n\nThere is room for your talent!\n\nPut your talent to work. At GFT, you'll be working with some of the brightest people in business and technology on challenging and rewarding projects in, a team of like-minded individuals.\nFeel it. We are #one team collaboratively working towards the same goal."
}