{
  "jobKey": "8bd3ab48db24ffd7",
  "title": "Data Analyst – Tableau - Remote",
  "companyName": "CÔNG TY TNHH MASS RECRUITMENT",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=8bd3ab48db24ffd7",
  "datePublished": "2025-09-28",
  "isRemote": false,
  "rating": 0,
  "numOfCandidates": null,
  "companyLogoUrl": null,
  "descriptionText": "Mô tả công việc:\n\n(Mức lương: 22 - 28 triệu VNĐ)\n\nWorking Hours :\n\n1/ Split shift : 3 PM - 6 PM (at office) and 9 PM - 2 AM (remote) (Mon – Fri)\n\n2/ Full 5-hour shift : 9 PM - 6 AM (initial training by the company, can work remotely).\n\nJob Descriptions :\n\n- Design, create and maintain Tableau dashboards\n\n- Conduct and create data analysis using Excel, SQL and Tableau\n\n- Work closely with data engineers to design data models, maintain and validate data in data warehouse\n\n- Conduct ad hoc industry research\n\n- Create and update slides used in client meetings, business reviews, etc.\n\n- Proactively communicate and collaborate with external and internal stakeholders to analyze information needs and functional requirements.\n\nChức vụ: Nhân Viên/Chuyên Viên\n\nHình thức làm việc: Toàn thời gian, Bán thời gian\n\nQuyền lợi được hưởng:\n\n- We treat people fairly and with dignity, keeping a healthy perspective about life and work and fostering a positive and enjoyable work environment with appealing benefits as below:\n\n- A competitive monthly salary based on your ability\n\n- 13th month Tet bonus & bi-annual performance bonus\n\n- Annual salary review\n\n- Attractive employee awards: Employee of Year, Semi-Annual outstanding employee\n\n- Social insurance and healthcare insurance upon Vietnam Labor Code\n\n- PTI insurance package, and annual health check\n\n- An English-speaking environment\n\n- An open culture that spurs creativity, innovation, and inclusivity\n\n- A variety of training courses for your career development\n\n- Diverse activities to foster relationships, including company trips, year-end party, employees’ birthdays\n\n- An open-space office, a cafeteria, and a range of modern equipment\n\n- Other allowance from referrals and special occasions (weddings, seniority, and new-born baby)\n\nYêu cầu bằng cấp (tối thiểu): Đại Học\n\nYêu cầu công việc:\n\n- English fluently (IELTS from 7.5)\n\n- Bachelor’s degree in MIS, Information Technology, Computer Science, or other quantitative major. An understanding of basic accounting/finance is a plus\n\n- Significant data management and analysis experience\n\n- Strong knowledge of Tableau and able to develop insightful dashboards and reports that drive business decision making and outcomes\n\n- Intermediate to advanced Database and Transact SQL skills\n\n- Intermediate PowerPoint\n\n- Experience in Python, C#, VBA, and SSIS packages is a plus\n\n- Understand data models, database design development, data mining and segmentation techniques\n\nWork Behavior :\n\n- Ability to lead, plan and manage in an entrepreneurial, team-oriented environment\n\n- Highly organized with strong project management skills, and drive to meet organizational objectives; ability to manage multiple projects on interrelated timelines.\n\n- Strong written and verbal communication skills\n\n- Results oriented self-starter, ready to challenge the status quo for continuous improvement and effectively solves problems and shares ideas for improvement with clear prioritization\n\nYêu cầu giới tính: Nam\n\nNgành nghề: Dữ Liệu - AI - Học Máy,Nghiên Cứu Thị Trường,Phân Tích Nghiệp Vụ (BA)\n\nĐại Học\n\n1 - 2 năm"
}