{
  "jobKey": "8bdd3f499c16bec5",
  "title": "[BSV] Intern Embedded Software Tester (C/C++, Modeling Language)",
  "companyName": "Bosch",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=8bdd3f499c16bec5",
  "datePublished": "2025-09-30",
  "isRemote": false,
  "rating": 4,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e4416ed92c2b93443c0fa949ef7c6202",
  "descriptionText": "Company Description\n\nThe Bosch Group is a leading global supplier of technology and services. It employs roughly 394,500 associates worldwide (as of December 31, 2020). According to preliminary figures, the company generated sales of 71.6 billion euros in 2020. Its operations are divided into four business sectors: Mobility Solutions, Industrial Technology, Consumer Goods, and Energy and Building Technology.\n\nThe Bosch Group comprises Robert Bosch GmbH and its roughly 440 subsidiaries and regional companies in some 60 countries. If its sales and service partners are included, then Bosch is represented in roughly 126 locations. This worldwide development, manufacturing, and sales network is the foundation for further growth.\n\nBGSV – Bosch Global Software Technologies Company Limited (Previous name: RBVH - Robert Bosch Engineering and Business Solutions Vietnam Company Limited) is 100% owned subsidiary of Robert Bosch GmbH.\n\nBGSV has started its operations from 19th October, 2010 at E-Town2 in HCMC. This engineering development center will be engaged in developing embedded systems and software, mechanical design and simulation, and will provide IT (SAP Consulting, JAVA Development….) and Business Services (Finance and accounting, Economics, Purchasing, Logistics, Translations Japanese-English-Japanese, Information Security) solutions to the Bosch group of companies globally.\n\nJob Description\n\nWe deliver software services to our partner for the OEMs in EURO regions such as Germany. We perform the end-to-end software development activities including all the roles like developers, testers, integrators, project managers and other special functions like functional safety and cyber security for our projects. We also work on the advanced engineering topics like software engineering for E&E architecture.\n\nJoin us in this noble cause of saving lives and develop your career towards these futuristic technologies.\n\nAs an Intern Embedded Software Tester for BSV, you will be doing Software-in-the -loop testing (SiL), Model-in the loop testing (MiL) for software components in Automotive domain. Your main responsibilities include:\n\n1. Perform Software Units Test/Components Test or model in the loop test:\n\nRequirement review (clarification and analysis requirement)\nDerive test case based on model.\nDesign and implement software requirements with Embedded C programming\nTest case specification/execution against SW requirements/model\nSupport and perform peer-review of the work products as per project needs\nInvestigate the problem reports in projects and perform Root cause analysis\nTest execution, results analysis and deviation justification as well as results documentation\n\n2. Develop/test automation tool\n\nQualifications\n\nUnder-graduated students with major in Computer Engineering/ Electrical-Electronics/ Electronics-Telecommunication/ Mechatronics Engineering/ Physical Engineering or related fields\nMandatory requirement\nGood C/C++ programming\nHave good knowledge in Matlab Simulink, ASCET or related modeling language\nPython/VBA scripting language,\nHave good knowledge on Unit/Module Testing, component testing\nAutomotive domain knowledge\nGood analytical and debugging skills\nGood English communication skills\nIt would be big advantage if you have: Have knowledge in V-model, Agile process; German communication skill is plus point\n#Verification and Validation (Embedded¸ SW and IT) #Embedded testing\n\nAdditional Information\n\nMonthly Internship Allowance, plus Meal and Parking support.\n1 paid leave day + 1 sick leave day for each internship month.\n1 birthday leave day if your birthday falls during the internship period.\nAccident insurance provided throughout the internship.\nOpportunity to observe and engage in international projects and innovation.\nAccess to our diverse training programs which surely help strengthen both your personal and professionalism.\nParticipation in various company activities such as football, yoga, badminton, and team building."
}