{
  "jobKey": "8cbcdf8aca16c8b0",
  "title": "Design Verification (Staff Engineer)",
  "companyName": "Marvell Technology",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=8cbcdf8aca16c8b0",
  "datePublished": "2025-09-25",
  "isRemote": false,
  "rating": 3.6,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/c769b04a0ba1d9aab7c1a9a59a9276d6",
  "descriptionText": "About Marvell\n\nMarvell’s semiconductor solutions are the essential building blocks of the data infrastructure that connects our world. Across enterprise, cloud and AI, automotive, and carrier architectures, our innovative technology is enabling new possibilities.\n\nAt Marvell, you can affect the arc of individual lives, lift the trajectory of entire industries, and fuel the transformative potential of tomorrow. For those looking to make their mark on purposeful and enduring innovation, above and beyond fleeting trends, Marvell is a place to thrive, learn, and lead.\n\nYour Team, Your Impact\n\nInfrastructure Processor Business Unit, a part of Networking and Processor Business Group, encompasses OCTEON and the award-winning OCTEON Fusion-M® product families. The SoC family of multi-core CPU processors and Radio Access SoCs offer best-in-class performance, low power, rich software ecosystem, virtualization features, and open source application support with highly optimized custom ARM CPU cores providing an excellent solution for a highly flexible end-to-end optimized 5G platform.\n\nAs part of the Infrastructure Processor unit at Marvell, you will verify all of the circuitry that goes inside our chips for the general market and for specific customers. These chips use cutting-edge technology to facilitate data transfers at high speeds, and you will help verify that each design meets our customers’ specifications whether they’re a major telecom organization or automotive company, etc.\n\nWhat You Can Expect\n\n- Work closely with design team to review the design spec and define detailed testplan\n\n- Develop UVM testbench at block level and SOC level for complex ASIC System-On-Chips\n\n- Run RTL and gate-level functional verification, debug failures, analyze and improve functional and code coverage\n\n- Develop and improve the verification flow and methodology\n\nWhat We're Looking For\n\n- BS/MS in Electrical, Computer, or Computer Science with high GPA score.\n\n- 5+ years of experience in ASIC verification.\n\n- Knowledge of ASIC design and verification flow including RTL design, simulation, synthesis, test bench development, regression.\n\n- Knowledge of System Verilog - Knowledge of UNIX environment, Perl, Shell scripting.\n\n- Knowledge of verification methodology such as UVM/OVM/VMM, define verification approach, and verification plans.\n\n- Knowledge of SSD/NAND/NVMe background knowledge.\n\n- Knowledge of CPU subsystem.\n\n- Knowledge of DDR/PCIE/SATA/SAS standard is a plus - Good written and oral communication skills in English.\n\nAdditional Compensation and Benefit Elements\n\nWith competitive compensation and great benefits, you will enjoy our workstyle within an environment of shared collaboration, transparency, and inclusivity. We’re dedicated to giving our people the tools and resources they need to succeed in doing work that matters, and to grow and develop with us. For additional information on what it’s like to work at Marvell, visit our Careers page.\n\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status.\n\nInterview Integrity\n\nAs part of our commitment to fair and authentic hiring practices, we ask that candidates do not use AI tools (e.g., transcription apps, real-time answer generators like ChatGPT, CoPilot, or note-taking bots) during interviews.\n\nOur interviews are designed to assess your personal experience, thought process, and communication skills in real-time. If a candidate uses such tools during an interview, they will be disqualified from the hiring process.\n\nThis position may require access to technology and/or software subject to U.S. export control laws and regulations, including the Export Administration Regulations (EAR). As such, applicants must be eligible to access export-controlled information as defined under applicable law. Marvell may be required to obtain export licensing approval from the U.S. Department of Commerce and/or the U.S. Department of State. Except for U.S. citizens, lawful permanent residents, or protected individuals as defined by 8 U.S.C. 1324b(a)(3), all applicants may be subject to an export license review process prior to employment.\n\n#LI-UN1"
}