{
  "jobKey": "939892379793e708",
  "title": "Data Scientist Intern",
  "companyName": "GeoComply",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=939892379793e708",
  "datePublished": "2025-10-01",
  "isRemote": false,
  "rating": 1.9,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/9e6fa69164dc61f4804879f9943dc605",
  "descriptionText": "About GeoComply\n\nWe’re GeoComply! We are at the forefront of geolocation, cybersecurity, and anti-fraud innovation, developing and delivering cutting-edge technologies to help ensure regulatory compliance, combat bad online actors, alleviate user friction, and protect businesses from fraud.\n\nAchieving significant business and revenue growth over the past three years and dubbed a tech “Unicorn,” GeoComply has been trusted by leading global brands and regulators for over ten years. Our compliance-grade geolocation technology solutions are installed on over 400 million devices and analyze over 12 billion transactions a year.\n\nAt the heart of it all is the people, united by a deep commitment to problem-solving and revolutionizing how people and businesses use the internet to instill confidence in every online interaction. With teams across five countries, three continents, and a global customer base, we have no plans to slow down.\n\nThe Role\nOur internship program allows early talent to get diverse and valuable experience, make a real impact, and find their place in one of the fastest-growing industries. As a Data Scientist Intern, you’ll find yourself constantly challenged and excited about the next big thing.\nKey Responsibilities\nDevelop and implement advanced machine learning models to detect location spoofing patterns within large datasets.\nConduct rigorous statistical analysis to identify anomalies and trends indicative of fraudulent activity.\nDesign and execute experiments to evaluate the effectiveness of different ML/AI algorithms.\nCollaborate Cross-Functionally: Work closely with engineer managers, data engineers, and other stakeholders to refine requirements, integrate the model into the ML platform, and make a measurable impact.\nPresent findings and recommendations to the team through clear and concise reports and presentations.\nOther Tasks as Assigned: Flexibility is key in a dynamic environment; you’ll help out on various projects and initiatives as needed.\nWho You Are\nEducated: Currently pursuing or recently graduated in Computer Science, Statistics, Mathematics, or a related quantitative field of study.\nCommunicative: Whether written or verbal, people know what you mean, what you are asking for, and what is expected\nAnalytical:You have an eye for detail and have the ability to interpret data into simple, intuitive information\nDetail-oriented: You have a keen eye for the little things, and you’re comfortable working with granular details\nOrganized:You have excellent organization, prioritization, and time management skills\nDiscrete: You maintain a high level of integrity and confidentiality of sensitive, complex information\nPatient: You are comfortable working through new problems for the first time that may not have an obvious or precise answer\nDiscrete: You maintain a high level of integrity and confidentiality of sensitive, complex information\nPersonable: Your great attitude makes you approachable and engaging, and you demonstrate excellent customer service\nInsightful: You are able to observe information and produce high-quality insights\nIndependent: You’re capable of assessing issues and initiating actions without waiting\nInitiative: You have the ability to independently assess issues and take action\nQuality-driven: You strive to achieve for the top in everything you do\nRespectful: you recognize that we do our best work when everyone feels accepted and included\nCollaborative: your primary objective is to work with others to achieve common goals\nProficient: You have knowledge of or experience with Python (especially libraries like scikit-learn, pandas, numpy), SQL, PySpark, machine learning algorithms, statistical modeling.\nBonus Points\nPublications or research experience in fraud detection or anomaly detection.\nExperience working in fraud detection.\nApply Now!\n\nInterested in joining our team? Send us your resume and a cover letter. We can’t wait to meet you!\n\nCommitment to Diversity and Equity.\nIf you don't tick every box in this job description, please don't rule yourself out. Research suggests that women and other people in underrepresented groups tend to only apply if they meet every requirement. We focus on hiring people who value inclusion, collaboration, adaptability, courage, and integrity rather than ticking boxes, so if this resonates with you, please apply.\n\nSearch Firm Representatives Please Read Carefully\nWe do not accept unsolicited assistance from search firms for employment opportunities. All CVs or resumes submitted by search firms to any employee at our company without a valid written agreement in place for this position will be considered the sole property of our company. No fee will be paid if a candidate is hired by GeoComply due to an agency referral where no existing agreement exists with the GeoComply Talent Acquisition Team. Where agency agreements are in place, introductions must be through engagement by the GeoComply Talent Acquisition Team.\n\nWhy GeoComply?\n\nJoining the GeoComply team means you’ll be part of an award-winning company to work, learn and grow. We are fast-paced, high-impact, and have a can-do team culture.\n\nTo be successful in our organization, you need an eager attitude, professionalism, and the confidence to willingly work to prove yourself and your ideas, and earn the trust of the organization.\n\nHere’s why we think you’d love working with us.\n\nWe’re working towards something big\nWe’ve built a reputation as the global market leader for geolocation compliance solutions for over 10 years. We’re trusted by customers from all over the world, and the next few years will be particularly exciting as we continue to scale across new markets.\n\nOur values aren’t just a buzzword\nOur values are the foundation for what we as a company care about most. They signify the commitment we make to each other around how we act and what we stand for. They are our north star as we work together to build a company we’re all proud to be a part of. Learn more, here.\n\nDiversity, equity, and inclusion are at the core of who we are\nIn collaboration with our team and external partners, we promote DEI in our recruitment and hiring practices; scholarships and financial aid; training and mentorship programs; employee benefits, and more.\n\nLearning is at the heart of our employee experience\nAt GeoComply, we foster an environment that empowers every employee to gain the knowledge and abilities needed to perform at their very best and help our organization grow. From a professional development budget to local training opportunities, knowledge-sharing sessions and more, we are continually investing in employee career growth and development.\n\nWe believe in being a force for good\nWe profoundly care about our impact on the world and strive to make meaningful contributions to the communities we work and live in. Our Impact division focuses on philanthropic and social responsibility initiatives, including supporting our local communities, advancing equality, and harnessing our technology to protect vulnerable groups. Learn more, here.\n\nWe care about our team\nOur GeoComply team is talented, driven and hard-working, and is known for its positive attitude and energy. At GeoComply, we take care of our employees with the total package. Team members are generously rewarded with competitive salaries, incentives, and a comprehensive benefits program.\n\nWe value in-person collaboration\nGeoComply culture thrives on a dynamic mix of in-person energy and independent focus and we champion a hybrid work model that blends the energy of in-person collaboration with the flexibility to work from home. Our 3-day in-office policy fosters teamwork and innovation, while also recognizing the importance of individual work styles and needs.\n\n- - - - - - - - - -\n\nAt GeoComply, we live our value of Act with Integrity. Our workplace is built on mutual respect and inclusion, and we welcome applicants of all backgrounds, experiences, beliefs, and identities. Creating an accessible interview experience for all candidates is important to us. If you have any requests (big or small) throughout our hiring process, please don’t hesitate to let us know so we can do our best to prioritize your needs.\n\nWe care about your privacy and want you to be informed about your rights. Please read our Applicant Privacy Notice before applying for the position."
}