{
  "jobKey": "9c93f49f00a93287",
  "title": "Regional Sales Manager",
  "companyName": "Abbott",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=9c93f49f00a93287",
  "datePublished": "2025-09-29",
  "isRemote": false,
  "rating": 3.9,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/75bf1a6fa23927699207a21afa4f2b8d",
  "descriptionText": "About Abbott\n\nAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.\n\nWorking at Abbott\n\nAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:\n\nCareer development with an international company where you can grow the career you dream of.\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.\n\nRole:\n\nResponsible for pushing long-term development for Abbott products in Region through distribution channels and brands building in stores with a leading high-performance sales team in territory in charged.\nResponsible for achieving monthly and quarterly sales target, market share and sales efficiency performance in Region with managing people and DA to ensure purposes of customer, consumer and user in store.\nPercentage contribution of scope: 50% Sales Management, 30% Customer Management and 20% Human Resource Management.\n\nAccountabilities:\n\nUnderstand consumer, shopper, retailer insight and channel landscape to reflect into building sales strategy, making business plan and coaching people.\nUse understanding of external and internal factors, under the direction, guidance from Abbott to build customized business plan plan of year/quarter/month for the territory assigned, based on clear and market – fit building blocks, source of growth.\nCollaborate across functions to contribute to an implementation of strategy and activity plan.\nDirectly involve and support DSM to design/implement/measure their yearly/quarterly/monthly business plan in each DA under territory in charged.\nDefine market potential, issue and opportunity for Abbott category/brand in specific area and design distribution plan and then cascade this plan to the team for execution.\nDirectly involve into set up/develop/evaluation or terminate DA in territory, base on process from Abbott.\nEstablish a sales team with high performance by building capability for each of employee level and channel development management.\nConduct coaching conversation with individual employees frequently, included in Se./DSM, SR and provide feedback on real-time developments and train employees in the field to help employees understand and apply SWOT at each point of sell (POS) in order to achieve an effective sales plan.\nAdopt an enterprise approach to regional management, paying attention to cross-departmental activities and influence to regional plan.\nPlay a business consultant to distributions for maximizing ROI, supporting strategies and Abbott priorities.\nNegotiate with regional distributors for a better local development strategy.\nEnsure good execution of each DA's business plan through understanding business realities and planning sales execution by region.\nMaintain an engaged and growing sales team.\nManage regions with targeted sale contribution with the high ownership mindset and excellent execution.\n\nApply well tools, applications for data management, sales performance and employee information management.\n\nRequirement:\n\nBachelor's degree\nMinimum 5 years of Sales experience in Nutrition industry or FMCG business, at least 3-year experience at Manager level with significant achievements.\nPersuasive Selling\nCustomer Management\nShopper-based category management\nForecasting & Supply Chain\nPeople management\nCustomer Business Planning\nPop Excellence in Execution\nStrategic Negotiation\nMS Office, Power BI is a good point"
}