{
  "jobKey": "9e4cf304cfc9d46c",
  "title": "(Senior) Product Specialist",
  "companyName": "Zalo",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=9e4cf304cfc9d46c",
  "datePublished": "2025-10-01",
  "isRemote": false,
  "rating": 5,
  "numOfCandidates": null,
  "companyLogoUrl": null,
  "descriptionText": "Hồ Chí Minh\nFull-time\n\nWe are seeking an exceptionally entrepreneurial Product Specialist to collaborate with engineers, designers, and AI specialists. You will drive innovation in AI and Generative AI products specifically for the Zalo ecosystem, aiming to create impactful, commercially successful solutions that enhance user experiences.\n\n   What you will do\nLead the ideation, launch, and commercialization of innovative AI and Generative AI products tailored for Zalo.\nDrive product development with a team of dynamic and talented engineers, designers, and AI specialists.\nIntegrate user research, market analysis, and AI capability insights into product requirements to enhance user value and satisfaction.\nDefine and analyze metrics that inform the success and commercial viability of AI products.\nUnderstand Zalo's strategic position and leverage cutting-edge AI/GenAI to deliver industry-leading product experiences.\nThrive in a constantly evolving environment, finding creative solutions for complex AI product challenges.\n   What you will need\nBachelor’s degree with at least 3 years of experience in Product Management, Business, or relevant roles, preferably in the IT/AI industry, with a proven track record overseeing the product development lifecycle.\nDemonstrated ability to achieve business goals; strong business acumen and an understanding of AI product commercialization strategies.\nSolid understanding of AI/ML concepts and their practical product implications.\nAbility to deeply understand user needs and identify market opportunities for AI applications through research and analysis.\nPassion for Artificial Intelligence, particularly Generative AI, and its potential within the Zalo ecosystem.\nExperienced in ideating, designing, and developing commercial AI products.\nExcellent communication, leadership, and presentation skills.\nProficient in logical thinking and adept at problem-solving, especially in AI implementation."
}