{
  "jobKey": "a26e3fa3c002d99a",
  "title": "Product Design Intern",
  "companyName": "ShopBack",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=a26e3fa3c002d99a",
  "datePublished": "2025-09-30",
  "isRemote": false,
  "rating": 3.9,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/daf03658c729a1138723ef46929c1b55",
  "descriptionText": "Our Journey\nShopBack began in 2014 as a late-night spark of inspiration between Henry and Joel — not just to build a Cashback platform, but to reimagine how brands and consumers connect. As former advertisers, they understood the limitations of traditional marketing, and saw an opportunity to deliver more value on both sides. That idea quickly turned into action, and the first prototype was built over a weekend with the other co-founders. Today, ShopBack serves over 50 million users across 13 markets, partners with 20,000+ merchants, and powers over half a million transactions daily. We're building The World’s Most Rewarding Way to Shop — and looking for bold, driven individuals to join us.\n\nJoin our mission to revolutionise shopping!\n\nAt ShopBack, we're dedicated to redefining the shopping journey for a more rewarding and user-friendly experience. As the Product Design Intern, you'll be at the forefront of this mission, specifically supporting on improving the browsing and discovery process.\n\nYou'll be collaborate with a diverse range of product and business teams across 13 different markets. Your designs will address the needs of various user groups while aligning with ambitious business goals.\n\nIf you thrive on challenges, love the fast-paced vibe, and are passionate about crafting seamless user experiences while creatively navigating constraints, we want to connect with you. Join us and be part of the team that's redefining how people shop and enjoy rewards!\n\nThis position is open for H1 2026 (January to June) applications.\nYour Adventure Ahead\nScope of works\nCollaborate with other designers and design managers in UI/UX solutions\nSupport user research activities like user interviews, surveys, usability testing and synthesising data.\nAssit in design operations, closely collaborating with campaign teams across 13 markets.\nMaintain and contribute to existing ShopBack design system\n\nWhat you will do:\nSolving complex problems: Your goal is to simplify the user experience. You'll transform tricky technical challenges and business needs into designs that are as easy to use as your favourite mobile app.\nResearching user insights: You'll use appropriate research methods to learn about our users and their needs. This helps us identify problems and develop with solutions that make sense.\nCrafting elegant user interfaces: You'll develop beautiful user interfaces, and contribute to the design team’s design system and patterns.\nDesigning for everyone: You'll create designs that are adaptable across various product features and resonate with users from 13 different countries and cultures.\nData-driven design: Data is our compass. You’ll look at both numbers and feedback from users to create designs that are not just stylish, but also grounded in evidence.\nChampion of users: You know our users inside out. You advocate for an improveduser experience and propose ideas to enhance it.\nInfluence product roadmap: You'll collaborate closely with our product team to prioritise problems to solve and experiment with ideas to improve the product.\nCollaborating with many teams: You'll work closely with product managers, engineers, data and research experts, our marketing team, and business leaders every day. It's a big team effort to make our product great!\n\nWhat it's like working here:\nLet's own our challenges! Here, we're more than just job titles. When a problem arises, everyone has the power to step in and make a real impact on our organization and the products we create.\nEvery day is a chance to improve. Perfection isn't our starting point; we believe in learning and adapting as we move forward, whether it's in product development or our own professional growth.\nWe succeed as a team. Our focus is on shared success, not individual triumphs. By bringing together our diverse skills, backgrounds, and perspectives, we're better equipped to tackle even the most difficult tasks together.\nEssentials to Succeed\nWho we're seeking:\nWe're on the lookout for someone special, and here's the kind of profile we're excited about:\nProven product and experience designer: You have a passion for designing intuitive and impactful digital products and experiences.\nUI/UX fundamentals: You've built strong foundations in both user interface (UI) and user experience (UX) design. Your portfolio showcases your past work, complete with explanations of why you made the design choices you did.\nApplies basic UX/UI principles, follows established content guidelines, performs basic research tasks. Understand and can apply principles and procedures of the craft to a well-defined brief.\nEffective communicator: You're good at engaging with users, collaborating with internal stakeholders, and liaising with engineers.\nProactive: You thrive in a fast-paced environment. You're the kind of person who takes the initiative and tackles challenges head-on.\nE-commerce interest: You have a genuine interest in the e-commerce sector, and it's a field you're enthusiastic about.\n\nIf this sounds like you, we'd love to hear from you. Let's chat about how you could be an exceptional addition to our team!\n\nApply now with your resume and portfolio (must have).\nShopBackers' DNA\nGrit - We tackle all challenges head-on, working together to solve problems and achieve success.\nHunger - We value hard work, and having relentless drive.\nSpeed - We move fast and have a bias for action, all to deliver maximum impact.\nImpact - We focus on results, always aiming for the best possible outcomes and timelines.\nGrowth - We embrace a growth mindset, constantly striving to learn, improve, and excel in our roles.\n\nExclusively for ShopBackers\nCareer progression paths and opportunities to take on greater challenges that help you realise your ambitions.\nBe part of a winning team on a journey to global scale.\nCompetitive compensation based on your performance.\nCandid, open, and collaborative culture where feedback is valued, for everyone to grow and improve every day.\n\nShopBack is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We do not discriminate on the basis of race, color, religion, sexual orientation, national origin, age, disability, genetic information, veteran status, or any other protected status under applicable laws. Join our team and help us make a difference!\n\nWe are committed to protecting your data and ensuring fairness in our recruitment process. We may use automated tools, including AI, to help our team screen applications, match candidates to roles, generate interview notes, and review assessments. These tools assist our recruiters and interviewers and they do not make final hiring decisions. If an assessment is part of your process, we may (with your consent) capture screen activity and/or webcam images during the test to help verify test integrity. We do not use AI to infer your emotions or sensitive traits. We process personal data lawfully, securely, and transparently in line with applicable data-protection laws and our commitment to fair employment. You can ask questions or exercise your rights including to request human review or to challenge an outcome by contacting dpo@shopback.com."
}