{
  "jobKey": "c125efad3f88992c",
  "title": "Global Training Engineer Intern",
  "companyName": "Intel Corporation",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=c125efad3f88992c",
  "datePublished": "2025-09-30",
  "isRemote": false,
  "rating": 4.1,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/a458bf4fc3f3de2f1a11c8236832b909",
  "descriptionText": "Job Details:\n\nJob Description:\n\nResponsibilities may be quite diverse of a nonexempt technical nature.\n\nU.S. experience and education requirements will vary significantly depending on the unique needs of the job.\n\nJob assignments are usually for the summer or for short periods during breaks from school.\n\nQualifications:\n\nShould be a 3rd or final year student pursuing a Bachelor's Degree in Business Administration, International Relation, Literature Studies, Industrial Engineering/Industrial Management, and/or other related majors.\n\nYour expected graduation date (including the date on a provisional graduation certificate) should be after December 2025.\n\nStrong verbal and written communication skills in English.\n\nDemonstrated excellent problem-solving skills.\n\nFamiliarity with statistical data analysis techniques.\n\nAble to work onsite for 3-4 days per week and enroll in a six-month internship program.\n\nOwnership mindset, detail-oriented, due-diligent, good communication skills.\n\nJob Type:\nStudent / Intern\n\nShift:\nShift 1 (Vietnam)\n\nPrimary Location:\nVietnam, Ho_Chi_Minh_City\n\nAdditional Locations:\n\nBusiness group:\nIntel Foundry strives to make every facet of semiconductor manufacturing state-of-the-art while delighting our customers - from delivering cutting-edge silicon process and packaging technology leadership for the AI era, enabling our customers to design leadership products, global manufacturing scale and supply chain, through the continuous yield improvements to advanced packaging all the way to final test and assembly. We ensure our foundry customers' products receive our utmost focus in terms of service, technology enablement and capacity commitments. Employees in the Foundry Technology Manufacturing are part of a worldwide factory network that designs, develops, manufactures, and assembly/test packages the compute devices to improve the lives of every person on Earth.\n\nPosting Statement:\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\nPosition of Trust\nN/A\n\nWork Model for this Role\nThis role will require an on-site presence. * Job posting details (such as work model, location or time type) are subject to change.\nPrivacy Statement:\n\nYour privacy matters to Intel and we comply with applicable data protection laws. We collect and maintain personal information for recruitment related activities and your data will not be used for any other purpose. We retain personal information for the periods and purposes set forth in Intel Privacy Notice . Retention periods can vary significantly based on the type of information and how it is used. We do not share your personal information with third parties.\n\nIn order for Intel to communicate with you on your application results, by submitting your information and proceeding with this application, you agree and consent that we can collect your personal information. You will have the ability to opt-out by informing vietnamjobs@ intel.com or at any time selecting unsubscribe found at the bottom of our future marketing communications. You have rights to correct, update, request access to or deletion of your personal information as described in Intel Privacy Notice. In addition, if you wish to update or otherwise make changes to your resume, use Intel online application tool to resubmit a new resume ."
}