{
  "jobKey": "cc9782b72b9eac2f",
  "title": "Software Developer (all genders welcome) in the field of Water Line Integrity Solutions",
  "companyName": "Rosenxt Group",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=cc9782b72b9eac2f",
  "datePublished": "2025-10-02",
  "isRemote": false,
  "rating": 5,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/204e6a29ce1750bb2b7fed11d7f44587",
  "descriptionText": "We are proud to be a branch of a Global company based in Europe.\nWhere people truly not only BELIEVE in what they're doing but giving their TRUST to each employees that they could growth along with company's vision.\n\nWe've committed to bringing passion and customer focus on the business.\n\nSoftware Developer (all genders welcome) in the field of Water Line Integrity Solutions\n\nWater Line Integrity Solutions, an innovative division of the Rosenxt Group, which was spun off in 2023 and is dedicated to expanding into new business areas. Our focus is on developing advanced technologies for the inspection and assurance of water pipeline integrity. In doing so, we contribute to the better use of limited water resources, supporting sustainability and environmental protection. Our state-of-the-art inspection devices autonomously move through water pipelines, gathering extensive data, including video and ultrasound data. To evaluate this data, we develop cloud-based software solutions that utilize classic signal processing algorithms and artificial intelligence (AI). In our interdisciplinary, agile, and autonomous teams, we foster innovations that create both business and ecological value.\n\nWhat you can expect\n\nDesign and develop robust software solutions on Microsoft Azure for processing large sensor data, ensuring scalability and maintainability\nOwn team-level architecture and product solutions, influencing related teams on certain projects\nDefine and implement innovative technological solutions to complex business problems\nIndependently code and design, with guidance on overall architecture when needed\nDevelop, test, deploy, and operate software, delivering high-quality production code\nClarify requirements, review code, provide constructive direction, and mitigate immediate risks\nSignificantly impact the software quality and user experience of the product and its features\n\nWhat to bring\n\nGood command of English (written and verbal)\nAt least 2-year++ experience in application development (especially web applications), including analyzing requirements, writing code, implementing tests, and developing the working practices of the team.\nDemonstrated ability to own and influence team-level architecture and product solutions\nSkilled in coding and designing production SW independently, with an understanding of broader architectural guidance\nExperience in solving complex software problems and delivering high-quality production code\nStrong impact on software quality and the user experience of products and features\nExcellent problem-solving skills, attention to detail, and strong communication and teamwork abilities\nSkills\n- Strong foundation of object-oriented programming, design & architectural patterns (especially microservice architecture)\n- Knowledge and ideal experience with at least one back-end technology stack ( Python , gRPC , MongoDB , .Net/ Java, Entity framework/Hibernate, ….)\n- Knowledge and ideal experience in the implementation of Microservices, Kubernetes / AKS, Container / Docker or similar technologies\nExperience working with GIT, Azure DevOps\nIt’s preferable to have knowledge in sensor data processing (esp. image & video)\n\nNice-to-have\n\nKnowledge & experience in sensor data processing (esp. image & video)\nOnboard within 6 weeks after being selected.\n\nLook forward to\n\nDevelopment opportunities and career opportunities in a global, innovative and long-term oriented group of companies with family character\nFlexible working time and Home Office possible\nAn open, informal corporate culture, where we celebrate success with social events\nVarious sports activities\nSalary on probation: competitive\nCapital accumulation benefits.\nFlextime accounts for all employees\nEmployer-funded pension\nHealth Insurance full 100%\nInsurance for Family\n13th month salary\nTravel opportunities\nWell-being & work-life balance: staying healthy through comprehensive health plans.\nStatutory Compliance: Labor compliance with local regulations that ensure employee security.\nWork Facilities: top-notch equipment, and A-class facilities.\nDiversity, Equity, Engagement, & Inclusion: Becoming part of a global team that celebrates differences, equal opportunity, and meaningful employee recognition.\nGrowth & Rewards: Thriving professionally through employee enablement, a culture of trust, and rewarding performance.\n\nMore information about the Rosenxt Group please click here\n\nwww.rosen-nxt.com\n\nIf you're open to new ideas and question conventional thought patterns. And you are looking for a varied and challenging job in an exciting and future-oriented environment of digitization, you'll enjoy your career with us!"
}