{
  "jobKey": "e9b3d5c21519a444",
  "title": "Senior Full Stack Engineer",
  "companyName": "ProfytAI",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=e9b3d5c21519a444",
  "datePublished": "2025-09-28",
  "isRemote": false,
  "rating": 0,
  "numOfCandidates": null,
  "companyLogoUrl": null,
  "descriptionText": "*Location:* Remote with occasional meetings with the team in Ho Chi Minh City\n\n*Employment Type:* Full-time, Direct hire\n\n*Experience: *4+ years\n\n*Company Description*\n\nProfytAI is a VC-backed Fintech AI startup at day one, specializing in AI-powered governance, risk, and compliance platforms for banking institutions. Our technology automates manual compliance processes, provides real-time risk monitoring, and helps banks stay ahead of regulatory changes across complex multi-jurisdictional requirements. Founded by industry veterans with over 40 years of combined experience from top firms like Deloitte, LinkedIn, and TrueCar, we address the $7.5B annual compliance cost crisis facing banks in Southeast Asia and beyond. This is your chance to join the ground floor and build out our product.\n\n*Role Description*\n\nThis is a full-time hybrid position based in Ho Chi Minh City. As Senior Full Stack Developer, you'll engineer the core of our SaaS platform from the front-end landing page to intuitive user dashboards that call AWS service endpoints. You'll work closely with experienced founders to establish technical excellence and build the foundation for our growing fintech platform, while owning critical technical decisions from day one.\n\n*What You'll Do*\n\n* Build responsive web applications using Next.js 15, TypeScript, and Tailwind CSS\n* Design and maintain scalable cloud services in AWS (Amplify, Cognito, S3, Lambda, DynamoDB)\n* Develop serverless functions in TypeScript and Python\n* Create interactive compliance dashboards powered by Lambda function APIs\n* Implement domain-driven design (DDD) patterns for long-term maintainability\n* Collaborate directly with founders and designers to deliver seamless user experiences\n* Create CI/CD pipelines and testing frameworks for production deployments (GitHub)\n\n*Qualifications*\n\n* 4+ years of full stack engineering experience with modern web technologies\n* Strong proficiency in Next.js 15, TypeScript, and Tailwind CSS\n* Deep knowledge of AWS services and serverless architectures\n* Proven ability building responsive SaaS dashboards and user interfaces\n* Familiarity with domain-driven design (DDD) principles\n* Experience with unit testing, integration testing, and CI/CD workflows (GitHub)\n* Bachelor's degree in Computer Science, Engineering, or related field\n\n*Preferred Qualifications*\n\n* Experience with data visualization libraries (Chart.js, D3.js, Recharts)\n* Understanding of Python for backend processing and data manipulation\n* Hands-on experience with document processing and text comparison algorithms\n* Knowledge of containerization technologies like Docker\n* AWS Certifications (Developer, Solutions Architect)\n* Experience in banking, financial services, or regulated industries\n* Background with compliance or regulatory document processing\n\n*Why This Role Matters* The platform you'll build directly empowers banking organizations to navigate complex regulatory requirements and streamline compliance processes. Your work impacts how financial institutions manage risk, ensure governance, and maintain regulatory adherence across multiple jurisdictions.\n\n*What We Offer*\n\n* Competitive salary\n* Flexible hybrid work arrangement with modern technology stack\n* Direct collaboration with experienced industry veterans\n* Growth opportunities in expanding fintech company\n* Performance bonuses and annual salary reviews\n\nJob Type: Full-time\n\nPay: 35,000,000₫ - 45,000,000₫ per month\n\n\n\nLanguage:\n* English (Required)\n\nLocation:\n* Ho Chi Minh City (Required)"
}