{
  "jobKey": "ea37b0e324b4fd54",
  "title": "[EDS] Senior Python Developer - (1 year Contractor)",
  "companyName": "Bosch",
  "location": "Thành phố Hồ Chí Minh",
  "salary": {},
  "jobUrl": "https://www.indeed.com/viewjob?jk=ea37b0e324b4fd54",
  "datePublished": "2025-09-30",
  "isRemote": false,
  "rating": 4,
  "numOfCandidates": null,
  "companyLogoUrl": "https://d2q79iu7y748jz.cloudfront.net/s/_squarelogo/256x256/e4416ed92c2b93443c0fa949ef7c6202",
  "descriptionText": "Company Description\n\nThe Bosch Group is a leading global supplier of technology and services. Its operations are divided into four business sectors: Mobility, Industrial Technology, Consumer Goods, and Energy and Building Technology. With technology that is “Invented for life,” Bosch wants to help improve quality of life and conserve natural resources.\n\nThe Bosch Group comprises Robert Bosch GmbH and its roughly 490 subsidiary and regional companies in over 60 countries. Including sales and service partners, Bosch’s global manufacturing, engineering, and sales network covers nearly every country in the world. Bosch’s innovative strength is key to the company’s further development.\n\nBosch Global Software Technologies Company Limited (BGSV) is 100% owned subsidiary of Robert Bosch GmbH, offering end-to-end Engineering, IT, and Business Solutions.\n\nStarting its operation from 2010 at Etown 2 in HCMC, BGSV is the first software development center of Bosch in Southeast Asia. BGSV nowadays have over 4,000 associates, with a global footprint and presence in the US, Europe, and the Asia Pacific region. With our unique ability to offer end-to-end solutions that connect sensors, software, and services, we enable businesses to move from the traditional to digital or improve businesses by introducing a digital element in their products and processes.\n\nBGSV currently operates from three offices located at the following addresses:\n\n1. Etown Building – 364 Cong Hoa Street, Ward 13, Tan Binh District, Ho Chi Minh City, Vietnam\n\n2. OfficeHaus Building – 32 Tan Thang Street, Son Ky Ward, Tan Phu District, Ho Chi Minh City, Vietnam\n\n3. Capital Place Building – 29 Lieu Giai Street, Ngoc Khanh Ward, Ba Dinh District, Hanoi, Vietnam\n\nJob Description\n\nThis position will be contracted through Bosch’s external vendor under a one-year agreement.\n\nDepartment Information:\nThe EDS department focuses on software tooling development to support embedded products in the Advanced Driver Assistance System (ADAS) domain. We develop tools that streamline software and system development for technologies such as radar, video, and ultrasonic sensors. Serving global teams across Japan, China, Europe, and Vietnam, we contribute to the advancement of secure, safe, and intelligent mobility solutions.\n\nWe are seeking a developer to build an integrated toolset/VS Code extension for Sphinx and Sphinx-Needs, which includes both a TypeScript, Rust-based CLI and a UI application with RAG (Retrieval-Augmented Generation) support. The tool will help developers and technical writers manage, search, and generate documentation more efficiently.\n\nDesign and implement a CLI tool to automate and extend Sphinx, Sphinx-Needs workflows (build, lint, check consistency, versioning, etc.).\n\nDevelop a UI interface in (VSCode, Web) for intuitive interaction with Sphinx projects.\n\nIntegrate RAG pipelines (e.g., vector DB like Qdrant, embeddings, LLM API) to enable semantic search, auto-suggestions, and smart documentation queries.\n\nConnect CLI ↔ UI ↔ RAG backend into a seamless developer experience.\n\nWrite unit tests, integration tests, and maintain detailed technical documentation.\n\nCollaborate with cross-functional teams to gather requirements and refine product features.\n\nQualifications\n\nBachelor’s degree in Engineering, Computer Science, or a related field\n\n3+ years of experience in Python, TypeScript, or Rust development\n\nHave experience in the development of Extension VSCode\n\nStrong skills in Rust, particularly for building performant CLI tools (experience with crates like clap and structopt).\n\nExperience in UI development (e.g., React, Tauri, or Rust-based UI frameworks).\n\nFamiliarity with RAG architecture:\n\nEmbedding models, vector databases (Qdrant, Pinecone, Weaviate, etc.).\n\nUnderstanding of Sphinx, ReStructuredText, and documentation pipelines.\n\nKnowledge of API design, CI/CD, and software release processes.\n\nGood English communication skills.\n\nMust Have\n\nExperience with Python, TypeScript or Rust ( Sphinx ecosystem).\n\nPrior contributions to open-source tooling.\n\nCross-platform packaging experience (Linux, Windows, macOS).\n\nAdditional Information\n\nFurther details regarding benefits will be shared during the interview process"
}