{
  "missions": [
    {
      "name": "Thu thập Thông tin Cá nhân (Header)",
      "goal": "Cung cấp thông tin liên hệ đầy đủ và chuyên nghiệp.",
      "objective": "Yêu cầu: 1 bộ thông tin cá nhân đầy đủ. Bao gồm: Họ và tên đầy đủ, Số điện thoại, Địa chỉ email chuyên nghiệp, Địa chỉ (Thành phố, Tỉnh/Thành phố), Link LinkedIn (nếu có), Link GitHub (nếu có).\n\nĐịnh nghĩa:\n- Họ và tên đầy đủ: Tên gọi chính thức, giúp nhà tuyển dụng xác định danh tính.\n- Số điện thoại: Phương thức liên lạc chính.\n- Địa chỉ email chuyên nghiệp: Email nên bao gồm tên của bạn (ví dụ: `ten.ho@email.com`), tránh biệt danh không chuyên nghiệp.\n- Địa chỉ: Cung cấp vị trí địa lý chung, giúp nhà tuyển dụng đánh giá sự phù hợp về địa điểm làm việc.\n- Link LinkedIn: Hồ sơ chuyên nghiệp trực tuyến, nơi chia sẻ chi tiết kinh nghiệm, kỹ năng và kết nối nghề nghiệp.\n- Link GitHub: Nền tảng lưu trữ mã nguồn, trưng bày các dự án cá nhân, đóng góp mã nguồn mở, thể hiện năng lực lập trình.\n\nMẫu cấu trúc:\n- Họ và tên: [Tên đầy đủ]\n- Số điện thoại: [Số điện thoại]\n- Email: [Địa chỉ email]\n- Địa chỉ: [Thành phố, Tỉnh/Thành phố]\n- LinkedIn: [Link LinkedIn]\n- GitHub: [Link GitHub]\n\nVí dụ minh họa:\n- Họ và tên: Nguyễn Văn A\n- Số điện thoại: 0987 654 321\n- Email: nguyenvana.ai@email.com\n- Địa chỉ: Quận 1, TP. Hồ Chí Minh\n- LinkedIn: linkedin.com/in/nguyenvanaai\n- GitHub: github.com/nguyenvanaai\n\nGhi chú bổ sung: Đảm bảo thông tin chính xác và dễ dàng liên lạc. Link LinkedIn và GitHub nên được cập nhật thường xuyên.\n\nLiên hệ trực tiếp với JD:\nJD yêu cầu 'kỹ năng lập trình Python vững chắc, có kinh nghiệm về thiết kế hướng đối tượng (object-oriented design)' và 'Sự nhiệt tình trong việc học hỏi công nghệ mới'. Link GitHub sẽ là nơi tuyệt vời để minh chứng cho các kỹ năng lập trình và các dự án liên quan đến AI/ML mà bạn đã thực hiện, thể hiện sự nhiệt tình và năng lực của bạn.",
      "priority": "high"
    },
    {
      "name": "Thu thập Thông tin Học vấn (Education)",
      "goal": "Trình bày nền tảng học vấn và các thành tích liên quan.",
      "objective": "Yêu cầu: Ít nhất 1 bậc học (Đại học/Cao đẳng). Bao gồm: Tên trường, Chuyên ngành, Thời gian học (Năm bắt đầu - Năm kết thúc hoặc 'Hiện tại'), GPA (nếu cao và muốn thể hiện), Các thành tích học tập nổi bật (học bổng, giải thưởng, đồ án tốt nghiệp xuất sắc, các môn học liên quan đạt điểm cao).\n\nĐịnh nghĩa:\n- Tên trường Đại học/Cao đẳng: Nơi bạn đã theo học để lấy bằng cấp.\n- Chuyên ngành đào tạo: Lĩnh vực kiến thức và kỹ năng bạn đã tập trung nghiên cứu.\n- Thời gian học: Khoảng thời gian bạn theo học tại trường.\n- GPA (Grade Point Average): Điểm trung bình học tập, thể hiện hiệu suất học tập tổng thể.\n- Thành tích học tập nổi bật: Những điểm nhấn trong quá trình học tập, chứng minh năng lực và sự nỗ lực vượt trội.\n\nMẫu cấu trúc:\n- [Tên trường Đại học/Cao đẳng]\n  - Chuyên ngành: [Tên chuyên ngành]\n  - Thời gian: [Năm bắt đầu] - [Năm kết thúc/Hiện tại]\n  - GPA: [Điểm GPA]/[Thang điểm]\n  - Thành tích: [Liệt kê các thành tích nổi bật]\n\nVí dụ minh họa:\n- Trường Đại học Bách Khoa Hà Nội\n  - Chuyên ngành: Khoa học Máy tính\n  - Thời gian: 2019 - 2023\n  - GPA: 3.8/4.0\n  - Thành tích: Học bổng Khuyến khích học tập loại Xuất sắc các năm 2020, 2021, 2022; Đồ án tốt nghiệp: 'Phát triển mô hình nhận dạng đối tượng thời gian thực sử dụng YOLOv5'.\n\nGhi chú bổ sung: Tập trung vào các môn học và dự án liên quan trực tiếp đến AI/ML, Khoa học Máy tính. Nếu GPA không cao, có thể bỏ qua hoặc chỉ liệt kê các môn học/thành tích nổi bật.\n\nLiên hệ trực tiếp với JD:\nJD yêu cầu 'Đang theo học hoặc vừa tốt nghiệp các ngành Khoa học Máy tính, Thống kê, Toán học hoặc các lĩnh vực định lượng liên quan'. Phần này sẽ cung cấp thông tin xác nhận bạn đáp ứng yêu cầu học vấn cơ bản. Các thành tích học tập liên quan đến AI/ML sẽ là điểm cộng lớn.",
      "priority": "high"
    },
    {
      "name": "Thu thập Tóm tắt Sự nghiệp/Mục tiêu Nghề nghiệp (Career Summary/Objective)",
      "goal": "Tạo ấn tượng ban đầu mạnh mẽ, tóm lược kinh nghiệm và định hướng.",
      "objective": "Yêu cầu: 1 đoạn tóm tắt ngắn gọn (2-4 câu). Nhấn mạnh kinh nghiệm, kỹ năng cốt lõi và định hướng nghề nghiệp, kết nối với mong muốn đóng góp cho công ty.\n\nĐịnh nghĩa:\n- Career Summary (Tóm tắt sự nghiệp): Giới thiệu ngắn gọn về kinh nghiệm, kỹ năng chính và thành tựu nổi bật.\n- Objective (Mục tiêu nghề nghiệp): Nêu rõ lĩnh vực muốn làm việc và mục tiêu phát triển cá nhân (thường dùng cho ứng viên ít kinh nghiệm, nhưng có thể kết hợp cho 'early-career').\n\nMẫu cấu trúc:\n[Kinh nghiệm/Vị trí hiện tại] với kinh nghiệm [Kỹ năng cốt lõi 1], [Kỹ năng cốt lõi 2] và [Thành tựu nổi bật]. Mong muốn [Mục tiêu nghề nghiệp/Đóng góp cho công ty] tại [Tên công ty].\n\nVí dụ minh họa:\n- 'Early-career AI/ML Engineer với kinh nghiệm thực tế trong phát triển các hệ thống Deep Learning, NLP và mô hình Transformer. Đã xây dựng thành công các hệ thống end-to-end trong các dự án học thuật và hackathon, bao gồm tích hợp LLM, tìm kiếm ngữ nghĩa và pipeline dữ liệu thời gian thực. Mong muốn áp dụng kiến thức chuyên môn vào các hệ thống sản xuất thực tế và phát triển sự nghiệp trở thành một AI Engineer chuyên nghiệp tại GeoComply.'\n\nGhi chú bổ sung: Cần tùy chỉnh cho phù hợp với từng JD. Sử dụng các từ khóa mạnh mẽ và định lượng hóa thành tựu nếu có thể.\n\nLiên hệ trực tiếp với JD:\nJD nhấn mạnh 'kỹ năng lập trình Python vững chắc', 'kiến thức hoặc sự quan tâm đến các khái niệm AI/ML, đặc biệt là các mô hình ngôn ngữ lớn (LLMs) và mô hình transformer', 'kỹ năng giải quyết vấn đề tốt', và 'sự nhiệt tình trong việc học hỏi công nghệ mới'. Tóm tắt này cần phản ánh rõ những điểm này và thể hiện sự phù hợp với vị trí 'Software Engineering Internship – AI Systems Development'.",
      "priority": "high"
    },
    {
      "name": "Thu thập Dự án/Thành tích (Projects/Achievements)",
      "goal": "Minh chứng năng lực kỹ thuật và khả năng áp dụng kiến thức vào thực tế.",
      "objective": "Yêu cầu: Ít nhất 2–3 dự án nổi bật. Mỗi dự án cần: Tên dự án, Mô tả ngắn gọn (1-2 câu về mục tiêu và chức năng chính), Vai trò của bạn trong dự án, Công nghệ sử dụng (liệt kê các công nghệ, framework, thư viện chính), Kết quả/Tác động (định lượng hóa nếu có thể, hoặc mô tả tác động/bài học rút ra).\n\nĐịnh nghĩa:\n- Dự án (Project): Công trình hoặc nhiệm vụ cụ thể có mục tiêu, phạm vi và kết quả rõ ràng. Bao gồm dự án học thuật, cá nhân, nghiên cứu, cuộc thi.\n- Thành tựu chính (Key Achievement): Kết quả hoặc đóng góp quan trọng, có ý nghĩa, thể hiện năng lực và giá trị của bạn.\n\nMẫu cấu trúc:\n- **[Tên dự án]**\n  - Vai trò: [Chức danh/Vai trò của bạn]\n  - Mô tả: [Mô tả ngắn gọn mục tiêu và chức năng]\n  - Công nghệ: [Liệt kê các công nghệ chính]\n  - Kết quả/Tác động: [Mô tả kết quả định lượng hoặc định tính]\n\nVí dụ minh họa:\n- **Hệ thống Tìm kiếm Ngữ nghĩa cho Tài liệu Nội bộ**\n  - Vai trò: AI/ML Engineer\n  - Mô tả: Phát triển hệ thống tìm kiếm thông minh cho phép truy vấn tài liệu bằng ngôn ngữ tự nhiên.\n  - Công nghệ: Python, PyTorch, Transformers (BERT), FAISS, Flask, Docker.\n  - Kết quả/Tác động: Cải thiện độ liên quan của kết quả tìm kiếm lên 30% so với hệ thống cũ.\n- **Tích hợp LLM cho Chatbot Hỗ trợ Khách hàng**\n  - Vai trò: ML Developer\n  - Mô tả: Xây dựng backend cho chatbot sử dụng mô hình ngôn ngữ lớn (LLM) để trả lời câu hỏi thường gặp.\n  - Công nghệ: Python, LangChain, OpenAI API, FastAPI, MongoDB.\n  - Kết quả/Tác động: Tự động hóa 70% các yêu cầu hỗ trợ ban đầu.\n\nGhi chú bổ sung: Ưu tiên các dự án có liên quan đến AI/ML, LLMs, transformer models, semantic search, data pipelines. Định lượng hóa kết quả là rất quan trọng. Nếu không có kinh nghiệm làm việc chính thức, phần này sẽ thay thế cho Work Experience.\n\nLiên hệ trực tiếp với JD:\nJD yêu cầu 'Phát triển và triển khai các mô hình học máy tiên tiến', 'Đóng góp vào việc cải thiện hệ thống AI đa tác tử', 'Phát triển và tinh chỉnh các tác tử AI', 'Mở rộng chức năng nền tảng để xử lý các định dạng dữ liệu đa dạng', 'Xây dựng các công cụ và tiện ích để hỗ trợ phân tích, kiểm thử và xác minh tự động'. Các dự án của bạn cần làm nổi bật kinh nghiệm với LLMs, transformer models, semantic search, data pipelines, và khả năng xây dựng hệ thống end-to-end. JD cũng đề cập 'Kinh nghiệm khóa học hoặc dự án trong lĩnh vực AI, ML hoặc hệ thống dữ liệu' là điểm ưu tiên.",
      "priority": "high"
    },
    {
      "name": "Thu thập Kỹ năng (Skills)",
      "goal": "Liệt kê các kỹ năng cứng và mềm, làm nổi bật sự phù hợp với yêu cầu công việc.",
      "objective": "Yêu cầu: Liệt kê chi tiết các kỹ năng cứng đã có và ít nhất 2-3 kỹ năng mềm liên quan đến công việc.\n\nKỹ năng cứng:\n- Machine Learning Frameworks: PyTorch, Tensorflow, Pandas, Scikit-learn, Matplotlib.\n- Big Data Tools: Apache Hadoop, Apache Spark, Apache Kafka.\n- Programming Languages: Python, C++.\n- Database: MySQL, MongoDB.\n- Other Tools: Git, Docker, Selenium, Jupyter.\n\nKỹ năng mềm:\n- Ít nhất 2-3 kỹ năng mềm liên quan đến công việc (ví dụ: làm việc nhóm, giải quyết vấn đề, giao tiếp, tư duy phản biện, khả năng học hỏi nhanh).\n\nĐịnh nghĩa:\n- Kỹ năng cứng (Hard Skills): Các kỹ năng chuyên môn, có thể học được và đo lường được.\n- Kỹ năng mềm (Soft Skills): Các phẩm chất cá nhân, thái độ và khả năng tương tác với người khác, giúp làm việc hiệu quả trong môi trường tập thể.\n\nMẫu cấu trúc:\n**Kỹ năng cứng:**\n- Ngôn ngữ lập trình: [Liệt kê]\n- Frameworks/Thư viện ML: [Liệt kê]\n- Công cụ Big Data: [Liệt kê]\n- Cơ sở dữ liệu: [Liệt kê]\n- Công cụ khác: [Liệt kê]\n\n**Kỹ năng mềm:**\n- [Kỹ năng mềm 1]\n- [Kỹ năng mềm 2]\n- [Kỹ năng mềm 3]\n\nVí dụ minh họa:\n**Kỹ năng cứng:**\n- Ngôn ngữ lập trình: Python (OOP, design patterns), C++\n- Frameworks/Thư viện ML: PyTorch, TensorFlow, Scikit-learn, Pandas, Matplotlib\n- Công cụ Big Data: Apache Spark, Apache Kafka\n- Cơ sở dữ liệu: MySQL, MongoDB\n- Công cụ khác: Git, Docker, Jupyter\n\n**Kỹ năng mềm:**\n- Làm việc nhóm hiệu quả\n- Giải quyết vấn đề sáng tạo\n- Giao tiếp rõ ràng và mạch lạc\n- Khả năng học hỏi nhanh và thích ứng với công nghệ mới\n\nGhi chú bổ sung: Phân loại rõ ràng kỹ năng cứng và mềm. Đảm bảo các kỹ năng liệt kê phù hợp với yêu cầu của JD.\n\nLiên hệ trực tiếp với JD:\nJD yêu cầu 'Kỹ năng lập trình Python vững chắc, có kinh nghiệm về thiết kế hướng đối tượng (object-oriented design)', 'kiến thức hoặc sự quan tâm đến các khái niệm AI/ML, đặc biệt là các mô hình ngôn ngữ lớn (LLMs) và mô hình transformer', 'Kỹ năng giải quyết vấn đề tốt'. JD cũng liệt kê các kỹ năng ưu tiên như 'Large Language Models, multi-agent frameworks, semantic search, transformer models, Advanced Python development (object-oriented design, design patterns), XML/JSON parsing, embeddings, structured/unstructured data handling, Multi-agent systems, modular design, configuration management'. Phần này cần làm nổi bật Python, OOP, LLMs, transformer models và các kỹ năng giải quyết vấn đề.",
      "priority": "high"
    },
    {
      "name": "Thu thập Chứng chỉ / Danh hiệu & Giải thưởng (Certifications / Honors & Awards)",
      "goal": "Tăng cường uy tín và minh chứng cho năng lực chuyên môn.",
      "objective": "Yêu cầu: Ít nhất 1-2 mục (nếu có). Bao gồm: Tên chứng chỉ/danh hiệu/giải thưởng, Tổ chức cấp, Thời gian đạt được (nếu có).\n\nĐịnh nghĩa:\n- Chứng chỉ (Certifications): Giấy chứng nhận hoàn thành khóa đào tạo hoặc đạt tiêu chuẩn kỹ năng từ tổ chức uy tín.\n- Danh hiệu & Giải thưởng (Honors & Awards): Sự công nhận chính thức về thành tích, đóng góp hoặc năng lực xuất sắc.\n\nMẫu cấu trúc:\n- **[Tên Chứng chỉ/Danh hiệu/Giải thưởng]**\n  - Tổ chức cấp: [Tên tổ chức]\n  - Thời gian: [Tháng/Năm]\n\nVí dụ minh họa:\n- **Deep Learning Specialization**\n  - Tổ chức cấp: Coursera\n  - Thời gian: 2022\n- **Quán quân Cuộc thi Hackathon AI Việt Nam 2023**\n  - Tổ chức cấp: Ban Tổ chức Hackathon AI Việt Nam\n  - Thời gian: 2023\n\nGhi chú bổ sung: Chỉ liệt kê các chứng chỉ/giải thưởng có giá trị và liên quan đến ngành nghề. Nếu có nhiều, ưu tiên những cái nổi bật nhất.\n\nLiên hệ trực tiếp với JD:\nJD không yêu cầu cụ thể về chứng chỉ, nhưng việc có các chứng chỉ liên quan đến AI/ML, Deep Learning, hoặc các giải thưởng từ các cuộc thi công nghệ sẽ là điểm cộng lớn, thể hiện sự chủ động học hỏi và năng lực cạnh tranh của bạn.",
      "priority": "low"
    },
    {
      "name": "Thu thập Thông tin Bổ sung (Additional Information)",
      "goal": "Cung cấp thêm thông tin về khả năng ngoại ngữ, sở thích hoặc các hoạt động khác có giá trị.",
      "objective": "Yêu cầu: Ít nhất 1-2 mục (nếu có). Bao gồm: Ngoại ngữ (mức độ thành thạo), Sở thích (liên quan đến ngành nghề hoặc thể hiện tính cách tích cực), Các hoạt động khác (CLB, tình nguyện, viết blog kỹ thuật).\n\nĐịnh nghĩa:\n- Ngoại ngữ: Khả năng sử dụng ngôn ngữ khác ngoài tiếng mẹ đẻ.\n- Sở thích: Hoạt động yêu thích làm trong thời gian rảnh, có thể thể hiện tính cách, sự sáng tạo hoặc khả năng cân bằng cuộc sống.\n- Hoạt động khác: Hoạt động ngoại khóa, cộng đồng hoặc cá nhân khác có thể bổ sung giá trị cho hồ sơ.\n\nMẫu cấu trúc:\n- Ngoại ngữ: [Ngôn ngữ] ([Mức độ thành thạo/Chứng chỉ])\n- Sở thích: [Liệt kê sở thích]\n- Hoạt động khác: [Liệt kê hoạt động]\n\nVí dụ minh họa:\n- Ngoại ngữ: Tiếng Anh (IELTS 7.0, giao tiếp thành thạo, đọc hiểu tài liệu kỹ thuật).\n- Sở thích: Đọc sách về AI và công nghệ mới, tham gia các buổi meetup về Machine Learning.\n- Hoạt động khác: Tình nguyện viên dạy lập trình cơ bản cho học sinh THPT.\n\nGhi chú bổ sung: Ngắn gọn, súc tích. Chỉ đưa thông tin có thể tạo ấn tượng tích cực hoặc liên quan đến công việc.\n\nLiên hệ trực tiếp với JD:\nJD đề cập đến 'Môi trường làm việc đề cao sự tôn trọng lẫn nhau, hòa nhập và đa dạng', 'Được đóng góp vào các sáng kiến trách nhiệm xã hội và cộng đồng'. Việc có các hoạt động tình nguyện hoặc sở thích liên quan đến cộng đồng có thể là điểm cộng. Khả năng ngoại ngữ tốt cũng rất quan trọng trong môi trường làm việc quốc tế.",
      "priority": "low"
    }
  ],
  "priority_order": [
    "Thu thập Thông tin Cá nhân (Header)",
    "Thu thập Thông tin Học vấn (Education)",
    "Thu thập Tóm tắt Sự nghiệp/Mục tiêu Nghề nghiệp (Career Summary/Objective)",
    "Thu thập Dự án/Thành tích (Projects/Achievements)",
    "Thu thập Kỹ năng (Skills)",
    "Thu thập Chứng chỉ / Danh hiệu & Giải thưởng (Certifications / Honors & Awards)",
    "Thu thập Thông tin Bổ sung (Additional Information)"
  ]
}