 ['{"full_name": "Đặng Vĩnh Hội", "phone_number": "0969.501.261", "email": "hoivd79@gmail.com", "address": "Gò Vấp, Thành phố Hồ Chí Minh", "linkedin": "hoivd", "github": "hoivd"}', '{"education": {"university": "Trường Công nghệ thông tin UIT", "major": "Khoa học Máy tính", "time": "2022 - 2026", "gpa": "3.1/4", "achievements": "Không có thành tích nổi bật"}}', '{"Career Summary/Objective": "Bỏ qua"}', '{"projects_achievements": [{"project_name": "CRIMEScan: AI System for Automated Web Collection and Risk Alert For Bankings System", "role": "Team Lead", "description": "An end-to-end modular system that automates the collection, classification, and analysis of crime-related articles. It combines a crawler, information extraction, cross-identification, and a dashboard to build a searchable criminal database and handle customer queries.", "technologies_used": "Python, Bedrock LLM, Cohere Embeddings, Faiss (Vector Databases)", "results_impact": "Customized the Crawl4AI tool with Bedrock LLM to enable automated crawling and classification of crime-related articles, significantly reducing processing time. Developed a criminal information extraction module by designing Named Entity Recognition (NER) prompts, achieving 95% accuracy. Built a Cross-Identification algorithm with 98.7% accuracy for constructing a criminal database and enabling customer queries, leveraging semantic search with Faiss and Cohere Embeddings. Implemented logging utilities to monitor pipeline execution and detect anomalies in real time. Designed and integrated a dashboard for seamless querying and analysis of criminal data."}, {"project_name": "Legal Document Retrieval", "role": "AI Engineer", "description": "A legal document retrieval system designed to handle text-based queries effectively by combining retrieval and ranking models.", "technologies_used": "Transformer-based Models, Pytorch, Hugging Face Transformers", "results_impact": "Top 3 SOCIT Competition, Accuracy: 0.71"}]}]', '{"Kỹ năng cứng": "Lập trình Python (thiết kế hướng đối tượng, design patterns), Large Language Models (LLMs), multi-agent frameworks, semantic search, transformer models", "Kỹ năng mềm": "Giải quyết vấn đề tốt"}', '{"Certifications/Honors & Awards": [{"certificate_name": "top 3 SOCIT", "issuer": "Đại học HUST", "date": "2024"}, {"certificate_name": "Chung kết VPBank Hackathon", "issuer": "VPBank", "date": "2025"}]}', '{"language": "Tiếng Anh (đọc tài liệu tiếng Anh)"}']